{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.15.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_3", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 42], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_4"}, "name": "input_4", "inbound_nodes": []}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_15", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_15", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 1}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 3}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_15", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_15", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_15", "inbound_nodes": [[["bidirectional_15", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_16", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_16", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 8}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 9}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 10}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_16", "inbound_nodes": [[["dropout_15", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_16", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_16", "inbound_nodes": [[["bidirectional_16", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_17", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_17", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 15}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 16}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 17}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_17", "inbound_nodes": [[["dropout_16", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_17", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_17", "inbound_nodes": [[["bidirectional_17", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_18", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_18", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 22}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 23}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 24}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_18", "inbound_nodes": [[["dropout_17", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_18", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_18", "inbound_nodes": [[["bidirectional_18", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_19", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_19", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 29}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 30}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 31}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_19", "inbound_nodes": [[["dropout_18", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_19", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_19", "inbound_nodes": [[["bidirectional_19", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "class_output", "trainable": true, "dtype": "float32", "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "class_output", "inbound_nodes": [[["dropout_19", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "reject_output", "trainable": true, "dtype": "float32", "units": 10, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "reject_output", "inbound_nodes": [[["dropout_19", 0, 0, {}]]]}], "input_layers": [["input_4", 0, 0]], "output_layers": [["class_output", 0, 0], ["reject_output", 0, 0]]}}, "training_config": {"loss": {"class_output": "categorical_crossentropy", "reject_output": "binary_crossentropy"}, "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "class_output_accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}, {"class_name": "Precision", "config": {"name": "class_output_precision_3", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}, {"class_name": "Recall", "config": {"name": "class_output_recall_3", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}], [{"class_name": "MeanMetricWrapper", "config": {"name": "reject_output_accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}, {"class_name": "Precision", "config": {"name": "reject_output_precision_3", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}, {"class_name": "Recall", "config": {"name": "reject_output_recall_3", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adamax", "config": {"name": "Adamax", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07}}}}, "weightsManifest": [{"paths": ["group1-shard1of5.bin", "group1-shard2of5.bin", "group1-shard3of5.bin", "group1-shard4of5.bin", "group1-shard5of5.bin"], "weights": [{"name": "bidirectional_15/forward_lstm_15/lstm_cell_46/kernel", "shape": [42, 512], "dtype": "float32"}, {"name": "bidirectional_15/forward_lstm_15/lstm_cell_46/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_15/forward_lstm_15/lstm_cell_46/bias", "shape": [512], "dtype": "float32"}, {"name": "bidirectional_15/backward_lstm_15/lstm_cell_47/kernel", "shape": [42, 512], "dtype": "float32"}, {"name": "bidirectional_15/backward_lstm_15/lstm_cell_47/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_15/backward_lstm_15/lstm_cell_47/bias", "shape": [512], "dtype": "float32"}, {"name": "bidirectional_16/forward_lstm_16/lstm_cell_49/kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_16/forward_lstm_16/lstm_cell_49/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_16/forward_lstm_16/lstm_cell_49/bias", "shape": [1024], "dtype": "float32"}, {"name": "bidirectional_16/backward_lstm_16/lstm_cell_50/kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_16/backward_lstm_16/lstm_cell_50/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_16/backward_lstm_16/lstm_cell_50/bias", "shape": [1024], "dtype": "float32"}, {"name": "bidirectional_17/forward_lstm_17/lstm_cell_52/kernel", "shape": [512, 1024], "dtype": "float32"}, {"name": "bidirectional_17/forward_lstm_17/lstm_cell_52/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_17/forward_lstm_17/lstm_cell_52/bias", "shape": [1024], "dtype": "float32"}, {"name": "bidirectional_17/backward_lstm_17/lstm_cell_53/kernel", "shape": [512, 1024], "dtype": "float32"}, {"name": "bidirectional_17/backward_lstm_17/lstm_cell_53/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_17/backward_lstm_17/lstm_cell_53/bias", "shape": [1024], "dtype": "float32"}, {"name": "bidirectional_18/forward_lstm_18/lstm_cell_55/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "bidirectional_18/forward_lstm_18/lstm_cell_55/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_18/forward_lstm_18/lstm_cell_55/bias", "shape": [512], "dtype": "float32"}, {"name": "bidirectional_18/backward_lstm_18/lstm_cell_56/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "bidirectional_18/backward_lstm_18/lstm_cell_56/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_18/backward_lstm_18/lstm_cell_56/bias", "shape": [512], "dtype": "float32"}, {"name": "bidirectional_19/forward_lstm_19/lstm_cell_58/kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_19/forward_lstm_19/lstm_cell_58/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_19/forward_lstm_19/lstm_cell_58/bias", "shape": [1024], "dtype": "float32"}, {"name": "bidirectional_19/backward_lstm_19/lstm_cell_59/kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_19/backward_lstm_19/lstm_cell_59/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_19/backward_lstm_19/lstm_cell_59/bias", "shape": [1024], "dtype": "float32"}, {"name": "class_output/kernel", "shape": [512, 10], "dtype": "float32"}, {"name": "class_output/bias", "shape": [10], "dtype": "float32"}, {"name": "reject_output/kernel", "shape": [512, 10], "dtype": "float32"}, {"name": "reject_output/bias", "shape": [10], "dtype": "float32"}]}]}